---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsRunRunJoinNotAllowedFailure
source: html/6aec0eb0-ee1e-defd-ba20-2c55ddb8908a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsRunRunJoinNotAllowedFailure Property

Run-Run join is not allowed of they have same "Start With Riser"/"End With Riser" configuration at the joined end.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsRunRunJoinNotAllowedFailure { get; }
```